---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionReferencesInvalid
source: html/cfa20fec-4a9d-3d7d-85fb-f6702220f4a5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionReferencesInvalid Property

One or more dimension references are or have become invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId DimensionReferencesInvalid { get; }
```